public/about.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-12 Thu 11:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/blog/static/style.css?v=1770912008" type="text/css"/>
<link rel="stylesheet" href="/blog/static/htmlize.css?v=1770912008" type="text/css"/>
<link rel="alternate" type="application/rss+xml" href="/blog/rss.xml" title="RSS feed for Liminal Desiderata">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <div class="sitelinks">
    <a href="/blog/index.html">Home</a>
    |
    <a href="/blog/blog.html">All Posts</a>
    |
    <a href="/blog/about.html">About</a>
    |
    <a href="/blog/contact.html">Contact</a>
  </div>
</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">About</h1>
</header><div id="outline-container-org4c455e1" class="outline-2">
<h2 id="org4c455e1">About Liminal Desiderata</h2>
<div class="outline-text-2" id="text-org4c455e1">
<p>
This blog explores the thresholds between systems design and human judgment, between engineering tradeoffs and values, between what exists and what is desired but not yet realized.
</p>
</div>
<div id="outline-container-org39027f9" class="outline-3">
<h3 id="org39027f9">What This Is</h3>
<div class="outline-text-3" id="text-org39027f9">
<p>
<i>Liminal Desiderata</i> is a collection of technical essays and personal philosophy aimed at experienced engineers, technical leaders, and reflective practitioners. The writing assumes familiarity with software systems, tradeoffs, and abstraction.
</p>

<p>
Topics include:
</p>
<ul class="org-ul">
<li>Distributed systems and infrastructure design</li>
<li>Abstraction, invariants, and failure modes</li>
<li>Career decisions and technical leadership</li>
<li>Tooling, productivity, and taste</li>
<li>Decision-making under uncertainty</li>
<li>Values encoded in systems</li>
</ul>
</div>
</div>
<div id="outline-container-org1478b43" class="outline-3">
<h3 id="org1478b43">The Name</h3>
<div class="outline-text-3" id="text-org1478b43">
<p>
<b>Liminal</b> comes from the Latin <i>līmen</i> (&ldquo;threshold&rdquo;). It refers to transitional or in-between states—periods where invariants are suspended and moments before structure hardens into decisions.
</p>

<p>
<b>Desiderata</b> is the plural of /desideratum/—&ldquo;things desired but not yet attained.&rdquo; These are articulated desired properties or outcomes that guide tradeoff discussions rather than end them.
</p>

<p>
Together, <b>Liminal Desiderata</b> captures the named things we want while we are between stable states.
</p>
</div>
</div>
<div id="outline-container-org409fe2d" class="outline-3">
<h3 id="org409fe2d">Approach</h3>
<div class="outline-text-3" id="text-org409fe2d">
<p>
The writing here:
</p>
<ul class="org-ul">
<li>Connects technical specifics to broader judgments</li>
<li>Names tradeoffs explicitly rather than hiding them</li>
<li>Assumes technical sophistication in readers</li>
<li>Optimizes for long-term intellectual coherence, not virality</li>
<li>Treats design and life decisions as structurally similar problems</li>
</ul>
</div>
</div>
<div id="outline-container-org67548f1" class="outline-3">
<h3 id="org67548f1">About the Author</h3>
<div class="outline-text-3" id="text-org67548f1">
<p>
Eduardo Apolinario is a software engineer interested in distributed systems, infrastructure, and the human aspects of technical decision-making.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="postamble" class="status">
Created by <a href="https://orgmode.org">Org Mode</a>
</div>
</div>
</body>
</html>
